configs/bases/v5_generation.yaml
# Everything a v5 generation run shares. A run config extends this and states only what it
# is actually varying, so the two or three lines that differ are visible instead of buried in
# ninety lines of restated context.
#
# Measured before this existed: 13 of 20 flattened keys were identical across all nine v5
# generation configs, and only `dataset.run_name` was unique to each.
#
# A child overrides by restating a key. Lists are replaced, not merged: `pr_numbers: [33117]`
# in a child means that PR and not that PR plus these.
scaffold_type: ape_agent

llm_config:
  model_name: gpt_5.2
  max_tokens: 32000
  thinking_budget_tokens: 30000
  temperature: 1.0

execution:
  max_turns: 40
  max_concurrency: 4

task_config:
  enabled_tools:
    - file_read
    - content_search
    - lean_verify
    - get_lean_goal
    - code_hover
    - code_goto

dataset:
  routing_mode: lead
  release: inputs/pr_review_v4/releases/dev-medium-0.3.0
  modification_inventory: inputs/pr_review_v4/treatments/systematic-opportunities-v2-medium/derived/modification_inventory.jsonl
  require_prebuilt_workspaces: true

  # The verification environment. A reviewed workspace is the base snapshot plus this PR's diff
  # plus its changed modules rebuilt; without it every compile resolves imports against the
  # base commit's .oleans, and a declaration the PR renames in a sibling file is an `Unknown
  # constant` in every other file -- 41 of 321 arm sessions on the held-out run, 16 findings
  # asserting a build failure on PRs that all build. `plan` reports how many episodes lack one.
  # Off only until they are prebuilt for the sets in use (~12 min each on this NFS, once):
  #   ./ape/bin/python -m src.mathlib_review.release.prebuild --reviewed --config <run config>
  # then flip this to true. A run that proceeds without them is told so at WARNING per attempt.
  require_reviewed_workspaces: false

  # Reads the base commit's `.ilean` index so importance can raise a proposal to `required`.
  # ~4.4s per distinct base commit.
  use_exposure_index: true

  # The deterministic arm is omitted by default: every finding scored should be one an agent
  # produced. A child that wants it states `execution_release`.

  # Caps bind BILLED cost — what was actually paid — not the no-cache counterfactual. A job
  # that used to stop at roughly 40% of its cap now spends the whole thing, so these are real
  # dollar ceilings rather than the accounting artefact they used to be. The old numbers read
  # roughly 5x tighter than they bound.
  #
  # Measured billed on smoke4 rep5: specialists median $0.039, max $0.117. 0.30 gives
  # cheap=$0.15, standard=$0.30, deep=$0.60 — about 2.5x headroom over the observed maximum
  # at the default tier.
  standard_budget_cap: 0.30
  # Leads billed a median $0.094 and a max $0.200 on rep5 — and that maximum is the lead that
  # died, so it is a floor on what a full one costs. 1.00 is ~5x it, which covers a
  # 184-proposal agenda read properly plus a second wave.
  lead_cost_cap: 1.00
  per_pr_cost_cap: 1.50
  max_delegations: 25

  # The whole run's ceiling. per_pr_cost_cap bounds only discretionary work -- the coverage
  # floor is exempt by design, and was therefore bounded by nothing at all. Preflight refuses
  # a run whose floor alone exceeds this, before the first model call.
  #
  # 10.00 against a measured floor of ~1.35 and worst-case discretionary of 6.00 on the four
  # smoke PRs: room to grow, but not room to run away.
  run_total_cost_cap: 10.00

  # The same five caps in processed tokens, which is the denomination that survives a price
  # of zero. Every cap above binds BILLED spend, and the four locally hosted elm_* models are
  # priced 0.0 because that is what they cost — so on those the whole block above is
  # decorative and these are the only budget the run has. `cli plan` refuses a run on a
  # zero-priced model that has left them unset.
  #
  # Calibrated 2026-09-22 at 1,200,000 processed tokens per billed dollar: measured over 16
  # v5 runs, median 1,230,650, range 1.01M–1.70M, and agreeing to within 4% across arms
  # (1,195,402), solo (1,155,912) and judge (1,152,608) tasks.
  # docs/research/2026-09-22-token-budget-calibration.md has the derivation.
  #
  # No exchange rate is applied at runtime — these are literal ceilings, and the rate was used
  # once to pick them. Their RATIOS are load-bearing: 1,800,000 / 360,000 = 5 is the same five
  # standard jobs a lead may buy under 1.50 / 0.30, so changing one without the others changes
  # what the lead does rather than what it is measured in.
  #
  # Against the measured distributions: arms p50 35,276 / p90 87,589 / p99 243,736 / max
  # 558,101, so 360,000 would have cut 6 of 2,857 arms (0.21%) where $0.30 cut none — the
  # heaviest arms are the cheapest per token, because a long investigation re-sends a cached
  # prefix at 1/14th the input rate. That gap is an artifact of the cache discount and does
  # not exist on the models this block is for, which report no cache at all.
  standard_budget_tokens: 360000
  lead_token_cap: 1200000
  per_pr_token_cap: 1800000
  solo_token_cap: 1800000
  # 12,000,000 against measured 12-PR run totals of 8.5M–16.7M, the same relation $10.00 has
  # to the same runs' $7.22–$14.05: a preflight estimate check, not a live ceiling.
  run_total_token_cap: 12000000